[Median](#median)

[Symmetric-Pair](#symmetric_pair)

[Sequence Grouping](#sequence_grouping)

[Pivot: Rows to columns](#pivot)

[Unpivot: Columns to rows](#unpivot)

You can even [link to Google!](http://google.com)

First Header | Second Header
------------ | -------------
Content from cell 1 | Content from cell 2
Content in the first column | Content in the second column

## Content

* [Chapter 1](#Chapter1)
* [Chapter 2](#Chapter2)

## Chapter 1    <div id="Chapter1"></div>

Some text here.  
Some text here.
Some text here.

<div id="Chapter2"></div>
## Chapter 2 

Some text here.  
Some text here.
Some text here.

* Tintin
  * A reporter
  * Has poofy orange hair
  * Friends with the world's most awesome dog
* Haddock
 * A sea captain
 * Has a fantastic beard
 * Loves whiskey
   * Possibly also scotch?

#### Difference between DELETE, DROP and TRUNCATE

https://www.geeksforgeeks.org/difference-between-delete-drop-and-truncate/

In [2]:
import pandas as pd
import pandasql as pds
import numpy as np
import sys

In [101]:
# https://mode.com/sql-tutorial/

#### Pivot Table

#### Pivoting rows to columns

In [5]:
data = pd.read_csv('./data_for_sql/1_data.csv')
print(data.head())
print(data.year.unique())

          conference year  players
0                ACC   FR      607
1                ACC   JR      356
2                ACC   SO      341
3                ACC   SR      259
4  American Athletic   FR      418
['FR' 'JR' 'SO' 'SR']

In [31]:
query = '''select conference,
sum(players) as total_players,
sum(case when year = 'FR' then players else NULL end) as FR,
sum(case when year = 'JR' then players else NULL end) as JR,
sum(case when year = 'SO' then players else NULL end) as SO,
sum(case when year = 'SR' then players else NULL end) as SR

from data
group by 1
order by 2 desc'''

In [30]:
pds.sqldf(query, locals())

           conference  total_players   FR   JR   SO   SR
0                 ACC           1563  607  356  341  259
1   American Athletic           1124  418  241  247  218
2              Big 12           1190  456  270  254  210
3             Big Sky           1198  442  249  273  234
4           Big South            565  181   94  102  188
5             Big Ten           1466  636  284  314  232
6                 CAA           1046  335  226  242  243
7      Conference USA           1495  519  351  324  301
8    FBS Independents            827  279  191  186  171
9    FCS Independents            453  203   83   98   69
10                Ivy            871  214  206  232  219
11               MEAC            966  375  188  223  180
12       Mid-American           1392  551  236  276  329
13    Missouri Valley            964  374  203  195  192
14      Mountain West           1285  458  314  263  250
15          Northeast            716  247  170  171  128
16        Ohio Valley            850  280  203  195  172
17             Pac-12           1377  501  280  317  279
18     Patriot League            635  148  171  166  150
19            Pioneer           1214  470  205  385  154
20                SEC           1650  659  368  362  261
21               SWAC            869  271  225  196  177
22           Southern            925  434  150  207  134
23          Southland            791  283  190  168  150
24           Sun Belt            866  324  211  144  187

#### Pivoting columns to rows

In [6]:
data = pd.read_csv('./data_for_sql/2_data.csv', encoding='cp1252')
print(data.head())

          magnitude  year_2000  year_2001  year_2002  year_2003  year_2004  \
0                >8          1          1          0          1          2
1             7–7.9         14         15         13         14         14
2             6–6.9        146        121        127        140        141
3             5–5.9       1344       1224       1201       1203       1515
4  Estimated Deaths        231      21357       1685      33819     298101

   year_2005  year_2006
0          1          2
1         10          9
2        140        142
3       1693       1712
4      87992       6605

In [78]:
df = pd.DataFrame(data = [2000,2001,2002,2003,2004,2005,2006], columns = ['year'])

In [100]:
pds.sqldf('''SELECT column1 as year
  FROM (values (2000),(2001),(2002),(2003),(2004),(2005),(2006)) ''', locals())

   year
0  2000
1  2001
2  2002
3  2003
4  2004
5  2005
6  2006

In [99]:
pds.sqldf('''SELECT *
  FROM data earthquakes
 CROSS JOIN 
 
 (SELECT column1 as year
  FROM (values (2000),(2001),(2002),(2003),(2004),(2005),(2006))) 
  
  order by year''', locals())

,magnitude,year_2000,year_2001,year_2002,year_2003,year_2004,year_2005,year_2006,year
0,>8,1,1,0,1,2,1,2,2000
1,7–7.9,14,15,13,14,14,10,9,2000
2,6–6.9,146,121,127,140,141,140,142,2000
3,5–5.9,1344,1224,1201,1203,1515,1693,1712,2000
4,Estimated Deaths,231,21357,1685,33819,298101,87992,6605,2000
5,>8,1,1,0,1,2,1,2,2001
6,7–7.9,14,15,13,14,14,10,9,2001
7,6–6.9,146,121,127,140,141,140,142,2001
8,5–5.9,1344,1224,1201,1203,1515,1693,1712,2001
9,Estimated Deaths,231,21357,1685,33819,298101,87992,6605,2001
10,>8,1,1,0,1,2,1,2,2002
11,7–7.9,14,15,13,14,14,10,9,2002
12,6–6.9,146,121,127,140,141,140,142,2002
13,5–5.9,1344,1224,1201,1203,1515,1693,1712,2002
14,Estimated Deaths,231,21357,1685,33819,298101,87992,6605,2002
15,>8,1,1,0,1,2,1,2,2003
16,7–7.9,14,15,13,14,14,10,9,2003
17,6–6.9,146,121,127,140,141,140,142,2003
18,5–5.9,1344,1224,1201,1203,1515,1693,1712,2003
19,Estimated Deaths,231,21357,1685,33819,298101,87992,6605,2003
20,>8,1,1,0,1,2,1,2,2004
21,7–7.9,14,15,13,14,14,10,9,2004
22,6–6.9,146,121,127,140,141,140,142,2004
23,5–5.9,1344,1224,1201,1203,1515,1693,1712,2004
24,Estimated Deaths,231,21357,1685,33819,298101,87992,6605,2004
25,>8,1,1,0,1,2,1,2,2005
26,7–7.9,14,15,13,14,14,10,9,2005
27,6–6.9,146,121,127,140,141,140,142,2005
28,5–5.9,1344,1224,1201,1203,1515,1693,1712,2005
29,Estimated Deaths,231,21357,1685,33819,298101,87992,6605,2005
30,>8,1,1,0,1,2,1,2,2006
31,7–7.9,14,15,13,14,14,10,9,2006
32,6–6.9,146,121,127,140,141,140,142,2006
33,5–5.9,1344,1224,1201,1203,1515,1693,1712,2006
34,Estimated Deaths,231,21357,1685,33819,298101,87992,6605,2006

In [81]:
query = '''select year, magnitude,
case when year = '2000' then year_2000
     when year = '2001' then year_2001
     when year = '2002' then year_2002
     when year = '2003' then year_2003
     when year = '2004' then year_2004
     when year = '2005' then year_2005
     when year = '2006' then year_2006 else NULL end as count
from 
(SELECT *
  FROM data earthquakes
 CROSS JOIN df) 
 order by 1 '''

In [102]:
# pds.sqldf(query, locals())

### SQL Window Functions

<b>RANK()</b> would give the identical rows a rank of 2, then skip ranks 3 and 4, so the next result would be 5    
<b>DENSE_RANK()</b> would still give all the identical rows a rank of 2, but the following row would be 3—no ranks would be skipped.

SUM, COUNT, and AVG
ROW_NUMBER()
RANK() and DENSE_RANK()
NTILE
LAG and LEAD

In [7]:
data = pd.read_csv('./data_for_sql/3_data.csv', encoding='cp1252')
print(data.head())

   duration_seconds      start_time        end_time  Start station number  \
0              1012  20-09-10 11:27  20-09-10 11:43                 31208
1                61  20-09-10 11:41  20-09-10 11:42                 31209
2              2690  20-09-10 12:05  20-09-10 12:50                 31600
3              1406  20-09-10 12:06  20-09-10 12:29                 31600
4              1413  20-09-10 12:10  20-09-10 12:34                 31100

                  start_terminal  End station number  \
0       M St & New Jersey Ave SE               31108
1                 1st & N St  SE               31209
2                  5th & K St NW               31100
3                  5th & K St NW               31602
4  19th St & Pennsylvania Ave NW               31201

                    end_terminal Bike number member_type
0                  4th & M St SW      W00742      Member
1                 1st & N St  SE      W00032      Member
2  19th St & Pennsylvania Ave NW      W00993      Member
3        Park Rd & Holmead Pl NW      W00344      Member
4                 15th & P St NW      W00883      Member

In [118]:
query = '''SELECT start_time, duration_seconds,
       SUM(duration_seconds) OVER (PARTITION BY start_terminal ORDER BY start_time) AS running_total
  FROM data '''

In [119]:
pds.sqldf(query, locals())

            start_time  duration_seconds  running_total
0       01-11-10 18:55              1157           1157
1        01-11-10 2:10               466           1623
2        01-11-10 2:40               169           1792
3       02-11-10 12:39               739           2531
4       02-11-10 17:24               691           3222
...                ...               ...            ...
115592  31-12-10 12:11              1487        1022023
115593  31-12-10 13:34              1309        1023332
115594  31-12-10 16:04               446        1023778
115595  31-12-10 19:54              1079        1024857
115596   31-12-10 6:38              1300        1026157

[115597 rows x 3 columns]

SUM, COUNT, and AVG

In [149]:
query = '''
select *,
MAX(running_total)    OVER (PARTITION BY start_terminal) AS max_running_total,
MAX(running_total)    OVER (PARTITION BY start_terminal ORDER BY start_time) AS max_running_total_with_order

from 
(
SELECT start_terminal,
       start_terminal,
       start_time,
       duration_seconds,
       SUM(duration_seconds)     OVER (PARTITION BY start_terminal ORDER BY start_time) AS running_total,
       COUNT(duration_seconds)   OVER (PARTITION BY start_terminal ORDER BY start_time) AS running_count,
       AVG(duration_seconds)     OVER (PARTITION BY start_terminal ORDER BY start_time) AS running_avg,
       
       ROW_NUMBER()              OVER (PARTITION BY start_terminal ORDER BY start_time) AS row_number,
       RANK()                    OVER (PARTITION BY start_terminal ORDER BY start_time) AS rank,
       DENSE_RANK()              OVER (PARTITION BY start_terminal ORDER BY start_time) AS dense_rank,
       DENSE_RANK()              OVER (PARTITION BY start_terminal) AS dense_rank_with_partition,
       DENSE_RANK()              OVER (ORDER BY start_time) AS dense_rank_with_order,
       NTILE(4)                  OVER (PARTITION BY start_terminal ORDER BY duration_seconds) AS quartile_4,
       
       LAG(duration_seconds, 1)  OVER (PARTITION BY start_terminal ORDER BY start_time) AS lag,
       LEAD(duration_seconds, 1) OVER (PARTITION BY start_terminal ORDER BY start_time) AS lead,
       
      duration_seconds - LAG(duration_seconds, 1) OVER (PARTITION BY start_terminal ORDER BY duration_seconds) AS lag_difference
  FROM data) '''

In [146]:
pds.sqldf(query, locals())

,start_terminal,start_terminal:1,start_time,duration_seconds,running_total,running_count,running_avg,row_number,rank,dense_rank,dense_rank_1,quartile_4,lag,lead,lag_difference,max_running_total,max_running_total_with_order
0,10th & Monroe St NE,10th & Monroe St NE,01-11-10 18:55,1157,1157,1,1157.000000,1,1,1,1098,2,NaN,466.0,1.0,242281,1157
1,10th & Monroe St NE,10th & Monroe St NE,01-11-10 2:10,466,1623,2,811.500000,2,2,2,407,1,1157.0,169.0,101.0,242281,1623
2,10th & Monroe St NE,10th & Monroe St NE,01-11-10 2:40,169,1792,3,597.333333,3,3,3,110,1,466.0,739.0,26.0,242281,1792
3,10th & Monroe St NE,10th & Monroe St NE,02-11-10 12:39,739,2531,4,632.750000,4,4,4,680,1,169.0,691.0,17.0,242281,2531
4,10th & Monroe St NE,10th & Monroe St NE,02-11-10 17:24,691,3222,5,644.400000,5,5,5,632,1,739.0,479.0,162.0,242281,3222
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
115592,Wisconsin Ave & Newark St NW,Wisconsin Ave & Newark St NW,31-12-10 12:11,1487,1022023,665,1536.876692,665,665,637,1428,4,1672.0,1309.0,0.0,1026157,1022023
115593,Wisconsin Ave & Newark St NW,Wisconsin Ave & Newark St NW,31-12-10 13:34,1309,1023332,666,1536.534535,666,666,638,1250,3,1487.0,446.0,0.0,1026157,1023332
115594,Wisconsin Ave & Newark St NW,Wisconsin Ave & Newark St NW,31-12-10 16:04,446,1023778,667,1534.899550,667,667,639,387,1,1309.0,1079.0,0.0,1026157,1023778
115595,Wisconsin Ave & Newark St NW,Wisconsin Ave & Newark St NW,31-12-10 19:54,1079,1024857,668,1534.217066,668,668,640,1020,3,446.0,1300.0,8.0,1026157,1024857
115596,Wisconsin Ave & Newark St NW,Wisconsin Ave & Newark St NW,31-12-10 6:38,1300,1026157,669,1533.866966,669,669,641,1241,3,1079.0,NaN,1.0,1026157,1026157

In [150]:
x = pds.sqldf(query, locals())

In [151]:
x.to_csv('./data_for_sql/output.csv',index=False)

### HackerRank

https://www.hackerrank.com/challenges/15-days-of-learning-sql/problem
1. find the hacker_id of the hacker who made maximum number of submissions each day. If more than one such hacker has a maximum number of submissions, print the lowest hacker_id. The query should print this information for each day of the contest, sorted by the date.

<b> 2.  a query to print total number of unique hackers who made at least 1 submission each day till date </b>

In [240]:
data = pd.read_csv('./data_for_sql/4_data.csv')
data['submission_date'] = pd.to_datetime(data['submission_date'], format = '%d-%m-%y')
data.head()

  submission_date  submission_id  hacker_id  score
0      2016-03-01           8494      20703      0
1      2016-03-01          22403      53473     15
2      2016-03-01          23965      79722     60
3      2016-03-01          30173      36396     70
4      2016-03-02          34928      20703      0

In [234]:
query = '''
select * from 
(
select *,
dense_rank() over (partition by submission_date order by sub_count desc, hacker_id asc) as sub_rank
from
(
select submission_date, hacker_id, count(*) as sub_count
from data
group by submission_date, hacker_id
)  )  where sub_rank = 1
'''

In [235]:
pds.sqldf(query, locals())

              submission_date  hacker_id  sub_count  sub_rank
0  2016-03-01 00:00:00.000000      20703          1         1
1  2016-03-02 00:00:00.000000      79722          2         1
2  2016-03-03 00:00:00.000000      20703          1         1
3  2016-03-04 00:00:00.000000      20703          1         1
4  2016-03-05 00:00:00.000000      36396          2         1
5  2016-03-06 00:00:00.000000      20703          1         1

In [241]:
data = data[['submission_date','hacker_id']].drop_duplicates()

In [247]:
query = '''
select submission_date, count(distinct hacker_id) as count
from
(
select a.*,
dense_rank() over (order by a.submission_date) as date_rank,
count(a.hacker_id) over (partition by a.submission_date, a.hacker_id) as hacker_count
from data a
cross join data b
on a.hacker_id = b.hacker_id
and b.submission_date <= a.submission_date) x
where date_rank = hacker_count
group by submission_date'''

In [248]:
pds.sqldf(query, locals())

              submission_date  count
0  2016-03-01 00:00:00.000000      4
1  2016-03-02 00:00:00.000000      2
2  2016-03-03 00:00:00.000000      2
3  2016-03-04 00:00:00.000000      2
4  2016-03-05 00:00:00.000000      1
5  2016-03-06 00:00:00.000000      1

In [253]:
# another method
query = '''
select submission_date, count(distinct hacker_id) as count
from
(
select a.*,
dense_rank() over (order by a.submission_date) as date_rank,
count(a.hacker_id) over (partition by a.hacker_id order by a.submission_date) as hacker_cum_count
from data a)
where date_rank = hacker_cum_count
group by submission_date
'''

In [254]:
pds.sqldf(query, locals())

              submission_date  count
0  2016-03-01 00:00:00.000000      4
1  2016-03-02 00:00:00.000000      2
2  2016-03-03 00:00:00.000000      2
3  2016-03-04 00:00:00.000000      2
4  2016-03-05 00:00:00.000000      1
5  2016-03-06 00:00:00.000000      1

https://www.hackerrank.com/challenges/the-company/problem

select c.company_code, founder, 
lm_count, sm_count, m_count, e_count  from company c

left join (select company_code,count(distinct lead_manager_code) as lm_count from lead_manager group by company_code) lm
on c.company_code = lm.company_code

left join (select company_code,count(distinct senior_manager_code) as sm_count from senior_manager group by company_code) sm
on c.company_code = sm.company_code

left join (select company_code,count(distinct manager_code) as m_count from manager group by company_code) m
on c.company_code = m.company_code

left join (select company_code,count(distinct employee_code) as e_count from employee group by company_code) e
on c.company_code = e.company_code

order by c.company_code;

#### Median 
<div id="median"> </div>

In [4]:
data = pd.read_csv('./data_for_sql/5_data.csv')

In [318]:
query1 = '''select round(avg(lat_n),4) as median from
    (
    select lat_n, 
        row_num, 
        max_row_num,
        case when max_row_num%2 = 0 then round(max_row_num/2.0 - 0.5) else round(max_row_num/2.0 + 0.5) end as min_id,
        case when max_row_num%2 = 0 then round(max_row_num/2.0 + 0.5) else round(max_row_num/2.0 + 0.5) end as max_id

        from 
        ( 
            select lat_n, 
                   row_num,
                   max(row_num) over() as max_row_num
            from
                (
                select lat_n, 
                       row_number() over(order by lat_n) as row_num
                from data) T1 
            ) T2 
    ) T3 where (min_id = row_num or max_id = row_num)'''

In [319]:
pds.sqldf(query1,locals())

   median
0    21.5

https://www.hackerrank.com/challenges/challenges/problem

In [274]:
data = pd.read_csv('./data_for_sql/6_data.csv')

In [284]:
query1 = '''
select *
from
(
select *,
count(hacker_id) over(partition by challenges_created) as freq_challenges_created,
max(challenges_created) over() as max_challenges_created
from
(
select c.hacker_id, count(*) as challenges_created
from data c
group by c.hacker_id
order by count(*) desc, hacker_id asc 
) x ) x
where (freq_challenges_created = 1 or challenges_created = max_challenges_created)
order by challenges_created desc, hacker_id asc
'''

In [288]:
# more efficient
query2 = '''
select 
*
from    (
        select 
          h.hacker_id
         ,count(*) as challenges_created
         ,count(*) over (partition by count(*)) as freq_challenges_created
         ,max(count(*)) over (order by 1) as max_challenges_created
        from data h 
        group by h.hacker_id
        )
where freq_challenges_created=1 or challenges_created=max_challenges_created
order by challenges_created desc, hacker_id
'''

In [ ]:
pds.sqldf(query1, locals())

In [289]:
pds.sqldf(query2, locals())

,hacker_id,challenges_created,freq_challenges_created,max_challenges_created
0,12299,6,2,6
1,34856,6,2,6
2,79345,4,1,6
3,80491,3,1,6
4,81041,1,1,6

### Sequence Grouping (min and max / range of the continuous sequence)
<div id="sequence_grouping"> </div>
Trick: Grouping by Distance   

https://community.oracle.com/docs/DOC-915680

In [405]:
data = pd.DataFrame( ([1,2,3,5,6,7,10,11,12,20,21]), columns = ['id'])
# data

In [410]:
print(pds.sqldf('''
 select id, 
            row_number() over(order by id) as row_num,
            id - row_number() over(order by id) as delta
     from data 
          ''',locals()))


print('\n',pds.sqldf('''
select 
    min(id) as range_start,
    max(id) as range_end,
    count(*) as group_range

from
(
     select id, 
            row_number() over(order by id) as row_num,
            id - row_number() over(order by id) as delta
     from data 
 ) x
 
 group by delta
          ''',locals()))

    id  row_num  delta
0    1        1      0
1    2        2      0
2    3        3      0
3    5        4      1
4    6        5      1
5    7        6      1
6   10        7      3
7   11        8      3
8   12        9      3
9   20       10     10
10  21       11     10

    range_start  range_end  group_range
0            1          3            3
1            5          7            3
2           10         12            3
3           20         21            2

https://www.hackerrank.com/challenges/sql-projects/problem

In [376]:
data = pd.read_csv('./data_for_sql/7_data.csv')
data['start_date'] = pd.to_datetime(data['start_date'])
data['end_date'] = pd.to_datetime(data['end_date'])
data

  start_date   end_date
0 2015-10-01 2015-10-02
1 2015-10-02 2015-10-03
2 2015-10-03 2015-10-04
3 2015-10-13 2015-10-14
4 2015-10-14 2015-10-15
5 2015-10-30 2015-10-31
6 2015-10-28 2015-10-29

In [389]:
pds.sqldf('''

select min(start_date) as range_start,
       max(end_date) as range_end
from
(
select *,
    row_number() over(order by start_date) as row_num,
    date(start_date, '-' || row_number() over(order by start_date) || ' day')  as delta
from data p
) x
group by delta
order by min(start_date)

''', locals())

                  range_start                   range_end
0  2015-10-01 00:00:00.000000  2015-10-04 00:00:00.000000
1  2015-10-13 00:00:00.000000  2015-10-15 00:00:00.000000
2  2015-10-28 00:00:00.000000  2015-10-29 00:00:00.000000
3  2015-10-30 00:00:00.000000  2015-10-31 00:00:00.000000

In [390]:
select min(start_date),
       max(end_date)
from
(
select *,
    row_number() over(order by start_date) as row_num,
    DATEDIFF(day, row_number() over(order by start_date), start_date) as delta
from projects p
) x
group by delta
order by DATEDIFF(day,min(start_date), max(end_date)) , min(start_date)

SyntaxError: invalid syntax (<ipython-input-390-ab3ecefb5ba5>, line 1)

#### Symmetric Pair
<div id="symmetric_pair"> </div>

https://www.hackerrank.com/challenges/symmetric-pairs/problem

Two pairs (X1, Y1) and (X2, Y2) are said to be symmetric pairs if X1 = Y2 and X2 = Y1.

Write a query to output all such symmetric pairs in ascending order by the value of X.

In [395]:
data = pd.DataFrame({'X':[10,20,20,20,23,22,21],'Y':[10,20,20,21,22,23,20]})
data

    X   Y
0  10  10
1  20  20
2  20  20
3  20  21
4  23  22
5  22  23
6  21  20

In [398]:
pds.sqldf('''
SELECT f1.X, f1.Y 
FROM data f1
INNER JOIN data f2 ON f1.X=f2.Y AND f1.Y=f2.X
GROUP BY f1.X, f1.Y
HAVING COUNT(f1.X)>1 or f1.X<f1.Y
ORDER BY f1.X 
''', locals())

    X   Y
0  20  20
1  20  21
2  22  23

The first condition in that line makes sure pairs with the same X and Y values don't get to count themselves as their symmetric pair. (e.g. if 10 10 appears one time it's not counted as a symmetric pair, but as 20 20 appears twice, that is a symmetric pair)

The second condition ensures that only one of a pair is displayed. (e.g. if 3 24 and 24 3 form a symmetric pair, it will only display 3 24, not 24 3 as well.)